# Pythons
brew 'python3'
# the zsh shell
brew 'zsh'
# this which will allow us to copy from within tmux / tmate
# Without this, tmate will crash given our settings
brew 'reattach-to-user-namespace'
# Allow the terminal to be shared
brew 'tmate'
# Package manager for Node.js
brew 'npm'
brew 'lnav'

tap 'homebrew/cask'
cask 'pycharm'
cask 'firefox'
cask 'google-chrome'
cask 'vlc'
cask 'spotify'
cask 'textmate'
cask '1password'
cask 'zoomus'
cask 'karabiner-elements'
cask 'whatsapp'
cask 'slack'
cask 'iterm2'
cask 'typinator'

